<details><summary>Digger run report at 2023-10-13 02:14:31 (UTC)</summary>
  <details><summary>Apply for <b>AppliNH/digger_demo_multienv#dev</b></summary>
  
```terraform
Terraform will perform the following actions:

  # module.dummy_bucket.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dummy-bucket-applinh"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.dummy_bucket.aws_s3_bucket.s3_bucket: Creating...
module.dummy_bucket.aws_s3_bucket.s3_bucket: Still creating... [10s elapsed]
module.dummy_bucket.aws_s3_bucket.s3_bucket: Creation complete after 17s [id=dummy-bucket-applinh]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>
</details>